SoCXin/HC32F4A0/src/hc32f4a0ritb_template/common/hc32f4a0ritb.h
/*  Bit definition for AOS_PEVNTIDR register  */
#define AOS_PEVNTIDR_PIN00_POS                         (0U)
#define AOS_PEVNTIDR_PIN00                             (0x00000001UL)
#define AOS_PEVNTIDR_PIN01_POS                         (1U)
#define AOS_PEVNTIDR_PIN01                             (0x00000002UL)
#define AOS_PEVNTIDR_PIN02_POS                         (2U)
#define AOS_PEVNTIDR_PIN02                             (0x00000004UL)
#define AOS_PEVNTIDR_PIN03_POS                         (3U)
#define AOS_PEVNTIDR_PIN03                             (0x00000008UL)
#define AOS_PEVNTIDR_PIN04_POS                         (4U)
#define AOS_PEVNTIDR_PIN04                             (0x00000010UL)
#define AOS_PEVNTIDR_PIN05_POS                         (5U)
#define AOS_PEVNTIDR_PIN05                             (0x00000020UL)
#define AOS_PEVNTIDR_PIN06_POS                         (6U)
#define AOS_PEVNTIDR_PIN06                             (0x00000040UL)
#define AOS_PEVNTIDR_PIN07_POS                         (7U)
#define AOS_PEVNTIDR_PIN07                             (0x00000080UL)
#define AOS_PEVNTIDR_PIN08_POS                         (8U)
#define AOS_PEVNTIDR_PIN08                             (0x00000100UL)
#define AOS_PEVNTIDR_PIN09_POS                         (9U)
#define AOS_PEVNTIDR_PIN09                             (0x00000200UL)
#define AOS_PEVNTIDR_PIN10_POS                         (10U)
#define AOS_PEVNTIDR_PIN10                             (0x00000400UL)
#define AOS_PEVNTIDR_PIN11_POS                         (11U)
#define AOS_PEVNTIDR_PIN11                             (0x00000800UL)
#define AOS_PEVNTIDR_PIN12_POS                         (12U)
#define AOS_PEVNTIDR_PIN12                             (0x00001000UL)
#define AOS_PEVNTIDR_PIN13_POS                         (13U)
#define AOS_PEVNTIDR_PIN13                             (0x00002000UL)
#define AOS_PEVNTIDR_PIN14_POS                         (14U)
#define AOS_PEVNTIDR_PIN14                             (0x00004000UL)
#define AOS_PEVNTIDR_PIN15_POS                         (15U)
#define AOS_PEVNTIDR_PIN15                             (0x00008000UL)

/*  Bit definition for AOS_PEVNTODR register  */
#define AOS_PEVNTODR_POUT00_POS                        (0U)
#define AOS_PEVNTODR_POUT00                            (0x00000001UL)
#define AOS_PEVNTODR_POUT01_POS                        (1U)
#define AOS_PEVNTODR_POUT01                            (0x00000002UL)
#define AOS_PEVNTODR_POUT02_POS                        (2U)
#define AOS_PEVNTODR_POUT02                            (0x00000004UL)
#define AOS_PEVNTODR_POUT03_POS                        (3U)
#define AOS_PEVNTODR_POUT03                            (0x00000008UL)
#define AOS_PEVNTODR_POUT04_POS                        (4U)
#define AOS_PEVNTODR_POUT04                            (0x00000010UL)
#define AOS_PEVNTODR_POUT05_POS                        (5U)
#define AOS_PEVNTODR_POUT05                            (0x00000020UL)
#define AOS_PEVNTODR_POUT06_POS                        (6U)
#define AOS_PEVNTODR_POUT06                            (0x00000040UL)
#define AOS_PEVNTODR_POUT07_POS                        (7U)
#define AOS_PEVNTODR_POUT07                            (0x00000080UL)
#define AOS_PEVNTODR_POUT08_POS                        (8U)
#define AOS_PEVNTODR_POUT08                            (0x00000100UL)
#define AOS_PEVNTODR_POUT09_POS                        (9U)
#define AOS_PEVNTODR_POUT09                            (0x00000200UL)
#define AOS_PEVNTODR_POUT10_POS                        (10U)
#define AOS_PEVNTODR_POUT10                            (0x00000400UL)
#define AOS_PEVNTODR_POUT11_POS                        (11U)
#define AOS_PEVNTODR_POUT11                            (0x00000800UL)
#define AOS_PEVNTODR_POUT12_POS                        (12U)
#define AOS_PEVNTODR_POUT12                            (0x00001000UL)
#define AOS_PEVNTODR_POUT13_POS                        (13U)
#define AOS_PEVNTODR_POUT13                            (0x00002000UL)
#define AOS_PEVNTODR_POUT14_POS                        (14U)
#define AOS_PEVNTODR_POUT14                            (0x00004000UL)
#define AOS_PEVNTODR_POUT15_POS                        (15U)
#define AOS_PEVNTODR_POUT15                            (0x00008000UL)

/*  Bit definition for AOS_PEVNTORR register  */
#define AOS_PEVNTORR_POR00_POS                         (0U)
#define AOS_PEVNTORR_POR00                             (0x00000001UL)
#define AOS_PEVNTORR_POR01_POS                         (1U)
#define AOS_PEVNTORR_POR01                             (0x00000002UL)
#define AOS_PEVNTORR_POR02_POS                         (2U)
#define AOS_PEVNTORR_POR02                             (0x00000004UL)
#define AOS_PEVNTORR_POR03_POS                         (3U)
#define AOS_PEVNTORR_POR03                             (0x00000008UL)
#define AOS_PEVNTORR_POR04_POS                         (4U)
#define AOS_PEVNTORR_POR04                             (0x00000010UL)
#define AOS_PEVNTORR_POR05_POS                         (5U)
#define AOS_PEVNTORR_POR05                             (0x00000020UL)
#define AOS_PEVNTORR_POR06_POS                         (6U)
#define AOS_PEVNTORR_POR06                             (0x00000040UL)
#define AOS_PEVNTORR_POR07_POS                         (7U)
#define AOS_PEVNTORR_POR07                             (0x00000080UL)
#define AOS_PEVNTORR_POR08_POS                         (8U)
#define AOS_PEVNTORR_POR08                             (0x00000100UL)
#define AOS_PEVNTORR_POR09_POS                         (9U)
#define AOS_PEVNTORR_POR09                             (0x00000200UL)
#define AOS_PEVNTORR_POR10_POS                         (10U)
#define AOS_PEVNTORR_POR10                             (0x00000400UL)
#define AOS_PEVNTORR_POR11_POS                         (11U)
#define AOS_PEVNTORR_POR11                             (0x00000800UL)
#define AOS_PEVNTORR_POR12_POS                         (12U)
#define AOS_PEVNTORR_POR12                             (0x00001000UL)
#define AOS_PEVNTORR_POR13_POS                         (13U)
#define AOS_PEVNTORR_POR13                             (0x00002000UL)
#define AOS_PEVNTORR_POR14_POS                         (14U)
#define AOS_PEVNTORR_POR14                             (0x00004000UL)
#define AOS_PEVNTORR_POR15_POS                         (15U)
#define AOS_PEVNTORR_POR15                             (0x00008000UL)

/*  Bit definition for AOS_PEVNTOSR register  */
#define AOS_PEVNTOSR_POS00_POS                         (0U)
#define AOS_PEVNTOSR_POS00                             (0x00000001UL)
#define AOS_PEVNTOSR_POS01_POS                         (1U)
#define AOS_PEVNTOSR_POS01                             (0x00000002UL)
#define AOS_PEVNTOSR_POS02_POS                         (2U)
#define AOS_PEVNTOSR_POS02                             (0x00000004UL)
#define AOS_PEVNTOSR_POS03_POS                         (3U)
#define AOS_PEVNTOSR_POS03                             (0x00000008UL)
#define AOS_PEVNTOSR_POS04_POS                         (4U)
#define AOS_PEVNTOSR_POS04                             (0x00000010UL)
#define AOS_PEVNTOSR_POS05_POS                         (5U)
#define AOS_PEVNTOSR_POS05                             (0x00000020UL)
#define AOS_PEVNTOSR_POS06_POS                         (6U)
#define AOS_PEVNTOSR_POS06                             (0x00000040UL)
#define AOS_PEVNTOSR_POS07_POS                         (7U)
#define AOS_PEVNTOSR_POS07                             (0x00000080UL)
#define AOS_PEVNTOSR_POS08_POS                         (8U)
#define AOS_PEVNTOSR_POS08                             (0x00000100UL)
#define AOS_PEVNTOSR_POS09_POS                         (9U)
#define AOS_PEVNTOSR_POS09                             (0x00000200UL)
#define AOS_PEVNTOSR_POS10_POS                         (10U)
#define AOS_PEVNTOSR_POS10                             (0x00000400UL)
#define AOS_PEVNTOSR_POS11_POS                         (11U)
#define AOS_PEVNTOSR_POS11                             (0x00000800UL)
#define AOS_PEVNTOSR_POS12_POS                         (12U)
#define AOS_PEVNTOSR_POS12                             (0x00001000UL)
#define AOS_PEVNTOSR_POS13_POS                         (13U)
#define AOS_PEVNTOSR_POS13                             (0x00002000UL)
#define AOS_PEVNTOSR_POS14_POS                         (14U)
#define AOS_PEVNTOSR_POS14                             (0x00004000UL)
#define AOS_PEVNTOSR_POS15_POS                         (15U)
#define AOS_PEVNTOSR_POS15                             (0x00008000UL)

